"use sctrict";
// let incr = 10,
//     decr = 10;
    
//     // incr++; /* Инкременто - увеличение значение на 1 */
//     // decr--; /* уменьшение показателя на 1 */
//     // Когда ставим  операторы '--' или '++' до значения, это называется префиксными, если после посфиксным. 
//     // Унарный оператор это оператор, который применяется к одному операнду
//     // console.log(incr);
//     // console.log(decr);
// /*     Бинарный оператор, это оператор который применился к двум оперантам */

// ++incr;
// --decr;
// console.log(incr);
// console.log(decr);

// console.log(incr++);
// console.log(decr--);
// Если мы используем оператор в консоле в постфексной форме*после* то переходим к изначальному значение если в префикскной, то происходит действие

let numbers = 5;
let strings = ' балов';
console.log(typeof numbers, typeof strings);